{
  "auto_mapping": null,
  "base_model_name_or_path": "vinai/bertweet-base",
  "inference_mode": true,
  "modules_to_save": [
    "classifier",
    "score",
    "classifier",
    "score"
  ],
  "num_attention_heads": 12,
  "num_layers": 12,
  "num_transformer_submodules": 1,
  "num_virtual_tokens": 20,
  "peft_type": "PROMPT_TUNING",
  "peft_version": "0.18.1",
  "prompt_tuning_init": "TEXT",
  "prompt_tuning_init_text": "Classify the sentiment of this tweet as positive or negative:",
  "revision": null,
  "task_type": "SEQ_CLS",
  "token_dim": 768,
  "tokenizer_kwargs": null,
  "tokenizer_name_or_path": "vinai/bertweet-base"
}